# 输入数据格式
b = \
    {
        "案号": "111",
        "收案日期": "2019",
        "当事人": [
            {}, {}, {}
        ],
        "财产线索": [
            {}, {}, {}
        ]
    }

# 输出数据格式
c = \
    {
        "result": 500,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "日志",
            "executeTime": 123123123123123,  # 执行时间
            "caseCode": ""
        }
    }

'''
收案       110
待裁定书生成   210
    执行 -》 生成裁定书
待立案     220 230
    执行 -》 盖章、立案、打印、移送、分案、收案
已立案     310 320 330 340 350
待总对总查询 410
待总对总反馈打印 420
待总对总冻结 430
待总对总冻结打印 440 
已完成 510

                                     p1                  p2                                             
收案 -----------》 待裁定书生成 -----------》 待立案 -----------》
        [审批]                     [执行]               [执行]

                    i1     o1         i2     o2         i3     o3         i4     o4         i5     o5         i6     o6         i7     o7
     210 -----------》 220 -----------》 230 -----------》 310 -----------》 320 -----------》 330 -----------》 340 -----------》 350 
  收案审批          裁定书生成          盖章              立案              打印              移送               分案              收案
  
                       i8            o8         i9                   o9          i10           o10        i11               o11
            -----------》 总对总查询 -----------》 总对总查询反馈打印 -----------》 总对总冻结 -----------》 总对总冻结打印



sd_case 案件表
    PRE_CASE_CODE   预案号
    CASE_CAUSE_NAME 案由
    SUE_AMOUNT      冻结金额
                    诉讼费（根据逻辑计算）
    CHIEF_JUDGE     审判长（法官）
    COURT_CLERK     书记员（法官助理）
    PRE_TRIAL_DATE  裁定时间（预立案时间）
    JUDGE_ASSISTANT 法官助理
    
    
sd_case_litigant 当事人
    LITIGATION_STATUS  一审诉讼地位
    LITIGANT_NAME      姓名
    LITIGANT_TYPE      类型
    CORPORATION_NAME   代表人姓名
    ID_NUMBER          身份证号
    ADRESS             户籍地址
    SEX                性别
    BIRTHDAY           生日
    NATION             民族
    ORGANAZATION_CODE  组织机构代码

sd_litigant_agent_rel
    AGENT_NAME  姓名
    AGENT_TPPYE 代理类型
    LAW_FIRM    所在律师事务所        
    
    
'''

i1 = \
    {
        "taskName": "执保裁定书生成",
        "data": [{
            "模板路径": "C:\\",
            "生成路径": "D:\\",
            "预案号": "(2019)闽0203执保210号",
            "案由": "罚金",
            "冻结金额": 520,
            # "诉讼费" 有计算公式
            "审判长": "柯祖锋",
            "法官助理": "郭志坚",
            "书记员": "谢丽明",
            "裁定时间": "2019-5-20 00:00:00",
            "当事人": [
                {
                    "姓名": "耿直",
                    "性别": "男",
                    "民族": "汉族",
                    "证件号码": "350623199511111111",
                    "地址": "福建省漳州市漳浦县",
                    "类型": "自然人",
                    "一审诉讼地位": "原告"
                },
                {
                    "姓名": "翊道",
                    "组织机构代码": "ZZJGDM2019",
                    "地址": "福建省漳州市漳浦县",
                    "代表人姓名": "李宗棠",
                    "类型": "法人",
                    "一审诉讼地位": "原告"
                },
                {
                    "姓名": "厦门基金会",
                    "地址": "福建省厦门市思明区",
                    "代表人姓名": "李宗棠",
                    "类型": "法人",
                    "一审诉讼地位": "被告"
                }
            ],
            "当事人代理": [
                {
                    "姓名": "李四",
                    "代理类型": 0,  # 0-法定代表人 1-委托代理人
                    "所在律师事务所": "厦门律师事务所"
                }
            ]
        }]
    }

o1 = \
    {
        "result": 200,
        "msg": "盖章",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i2 = \
    {
        "taskName": "执保盖章",
        "data": {
            "文书路径": "C:\\",
            "帐号": "spxt",
            "密码": "123456"
        }
    }

o2 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i3 = \
    {
        "taskName": "执保立案",
        "data": {}
    }

o3 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123,  # 执行时间时间戳
            "caseCode": "(2019)闽0203执保520号"
        }
    }

i4 = \
    {
        "taskName": "执保打印",
        "data": {
            "帐号": "刘雄嘉",
            "密码": "5306558",
            "案号": "(2019)闽0203执保520号"
        }
    }

o4 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i5 = \
    {
        "taskName": "执保移送",
        "data": {
            "帐号": "刘雄嘉",
            "密码": "5306558",
            "立案部门": "立案庭（保全组）",
            "案号": "(2019)闽0203执保520号"
        }
    }

o5 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i6 = \
    {
        "taskName": "执保分案",
        "data": {
            "帐号": "刘闽生",
            "密码": "123",
            "承办法官": "甘小明",
            "案号": "(2019)闽0203执保520号"
        }
    }

o6 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i7 = \
    {
        "taskName": "执保收案",
        "data": {
            "帐号": "甘小明",
            "密码": "123",
            "案号": "(2019)闽0203执保520号"
        }
    }

o7 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i8 = \
    {
        "taskName": "总对总查询",
        "data": {
            "帐号": "甘小明",
            "密码": "123",
            "案号": "(2019)闽0203执保520号"
        }
    }

o8 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i9 = \
    {
        "taskName": "总对总查询反馈打印",
        "data": {
            "帐号": "甘小明",
            "密码": "123",
            "案号": "(2019)闽0203执保520号"
        }
    }

o9 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

i10 = \
    {
        "taskName": "总对总冻结",
        "data": {
            "帐号": "甘小明",
            "密码": "123",
            "案号": "(2019)闽0203执保520号",
            "冻结金额": 520,
            "冻结金额下限": 500
        }
    }

o10 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123,  # 执行时间时间戳
            "totalAmount": 521  # 实际冻结金额
        }
    }

i11 = \
    {
        "taskName": "总对总冻结打印",
        "data": {
            "帐号": "甘小明",
            "密码": "123",
            "案号": "(2019)闽0203执保520号"
        }
    }

o11 = \
    {
        "result": 200,
        "msg": "",
        "data": {
            "executeStatus": 1,  # 1-成功 2-失败
            "executeMsg": "执行成功",
            "executeTime": 123123123123123  # 执行时间时间戳
        }
    }

{
    "taskName": "总对总查询",
    "data": [
        {
            "案号": "(2019)闽0203执1号",
            "帐号": "柯祖锋",
            "密码": "123"
        },
        {
            "案号": "(2019)闽0203执2号",
            "帐号": "柯祖锋",
            "密码": "123"
        },
        {
            "案号": "(2019)闽0203执3号",
            "帐号": "柯祖锋",
            "密码": "123"
        }
    ]
}

{
    "result": 200,
    "msg": "",
    "data": {
        "executeStatus": 1,  # 1-成功 2-失败
        "executeMsg": "执行成功",
        "executeTime": 123123123123123  # 执行时间时间戳
    }
}

